{"name": "ITH – Impossible Travel", "rule_id": "0f9793ec-b329-4979-8fdd-9879dd0439e0", "description": "ITH baseline detection: ITH – Impossible Travel", "risk_score": 80, "severity": "high", "type": "query", "query": "event.scenario: \"impossible_travel\"", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
{"name": "ITH – MFA Bypass", "rule_id": "50c9827c-565f-4d18-acda-7a75312ec7fa", "description": "ITH baseline detection: ITH – MFA Bypass", "risk_score": 80, "severity": "high", "type": "query", "query": "event.scenario: \"mfa_bypass\"", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
{"name": "ITH – Brute Force Then Success", "rule_id": "3faddda2-066d-47e8-86f7-85c9557bd1f4", "description": "ITH baseline detection: ITH – Brute Force Then Success", "risk_score": 85, "severity": "high", "type": "query", "query": "event.scenario: \"brute_force_then_success\"", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
{"name": "ITH – Rare Country Login", "rule_id": "7226e0cf-e729-4c49-bfa0-d499147586ed", "description": "ITH baseline detection: ITH – Rare Country Login", "risk_score": 60, "severity": "medium", "type": "query", "query": "event.scenario: \"rare_country\"", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
{"name": "ITH – Credential Stuffing", "rule_id": "fff6d590-1a6e-415f-a6ad-d7081cbaa2cd", "description": "ITH baseline detection: ITH – Credential Stuffing", "risk_score": 85, "severity": "high", "type": "query", "query": "event.scenario: \"credential_stuffing\"", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
{"name": "ITH – ASN / ISP Change", "rule_id": "f300b3dd-5f34-4ba3-86f4-bebb692a2e00", "description": "ITH baseline detection: ITH – ASN / ISP Change", "risk_score": 60, "severity": "medium", "type": "query", "query": "event.scenario: \"asn_change\"", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
{"name": "ITH – Privilege Escalation", "rule_id": "2560b9ac-2bae-4937-917e-a69c5d1367c3", "description": "ITH baseline detection: ITH – Privilege Escalation", "risk_score": 90, "severity": "high", "type": "query", "query": "event.scenario: \"privilege_escalation\"", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
{"name": "ITH – All Scenarios (Judge Demo)", "rule_id": "650ed815-5142-4e1f-8a62-695fd7df2cd4", "description": "ITH baseline detection: ITH – All Scenarios (Judge Demo)", "risk_score": 90, "severity": "high", "type": "query", "query": "event.scenario: *", "language": "kuery", "index": ["ith-events*"], "from": "now-5m", "interval": "1m", "enabled": true, "tags": ["ITH", "baseline"], "author": ["Identity Threat Hunter"], "references": [], "false_positives": [], "threat": [], "filters": [], "max_signals": 100, "to": "now", "actions": [], "throttle": "no_actions", "exceptions_list": [], "version": 1, "immutable": false, "meta": {}, "note": "", "related_integrations": [], "required_fields": [], "setup": ""}
