{"id":"780eb712-7f24-447e-a1fd-0cf23a77d243","updated_at":"2025-10-17T13:15:09.329Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.717Z","created_by":"95289865","name":"ITH - Quantum Guardian High-Risk Finding","tags":["ITH","QuantumGuardian","NoConnector"],"interval":"5m","enabled":true,"revision":9,"description":"Surfaces high/critical Quantum Guardian findings or risk_score >= 70.","risk_score":80,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"author":[],"false_positives":[],"from":"now-7m","rule_id":"ith-quantum-guardian-highrisk-v5-1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["quantum-guardian"],"query":"(severity: (\"high\" or \"critical\")) OR (risk_score >= 40) or (category: anomaly) OR raw.rule.name:\"ITH*\"","filters":[],"actions":[]}
{"id":"bd036d86-aaab-4461-a7a0-d6c7a5ba9cf3","updated_at":"2025-10-17T13:14:27.904Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.721Z","created_by":"95289865","name":"Suspicious PowerShell (AutoTriage)","tags":[],"interval":"5m","enabled":true,"revision":8,"description":"Suspicious PowerShell (AutoTriage)","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"timestamp_override":"@timestamp","author":[],"false_positives":[],"from":"now-15m","rule_id":"8933539c-4fda-4135-9d8c-5a3e2e469f5f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.ingestor.service.keyword:\"PowerShell-ITH-Trigger\" OR raw.ingestor.service:\"PowerShell-ITH-Trigger\" OR raw.rule.name: \"Suspicious*\"\n","filters":[],"actions":[]}
{"id":"f3b35dda-27e0-437a-bb74-45940424da06","updated_at":"2025-10-17T13:15:52.494Z","updated_by":"95289865","created_at":"2025-10-16T23:57:45.097Z","created_by":"95289865","name":"ITH – Impossible Travel (Custom, with Response Actions)","tags":["ITH","Quantum-Response","Demo","Impossible Travel"],"interval":"5m","enabled":true,"revision":13,"description":"Custom clone for hackathon demo. Detects impossible travel or high-risk authentication, then automatically runs an OSquery sweep and isolates the host via Elastic Defend.","risk_score":90,"severity":"high","note":"Demo rule for Judges: shows automatic Osquery + Host Isolation on alert.","license":"Elastic License","output_index":"","meta":{"kibana_siem_app_url":""},"author":["ITH Hackathon"],"false_positives":[],"from":"now-15m","rule_id":"ith-impossible-travel-custom-b09658c1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"},{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name LIKE '%mstsc%' OR name LIKE '%TeamViewer%' OR name LIKE '%AnyDesk%' OR name LIKE '%ssh%' OR name LIKE '%vpn%' LIMIT 20;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"query":"SELECT p.name AS process_name, s.pid, s.remote_address, s.remote_port, s.state FROM process_open_sockets s JOIN processes p ON p.pid = s.pid WHERE p.name LIKE '%mstsc%' OR p.name LIKE '%TeamViewer%' OR p.name LIKE '%AnyDesk%' OR p.name LIKE '%ssh%' OR p.name LIKE '%vpn%' LIMIT 50;\r\n","timeout":60},"action_type_id":".osquery"}],"setup":"","type":"query","language":"kuery","index":["logs-*","filebeat-*","ith-events"],"query":"raw.scenario:\"impossible_travel\" OR event.action:\"impossible_travel\" OR raw.rule.name:\"ITH - Impossible Travel\" OR risk.score >= 80","filters":[],"actions":[]}
{"id":"03c83e33-c49f-461f-b649-c9b27a376210","updated_at":"2025-10-17T14:09:10.620Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.865Z","created_by":"95289865","name":"ITH – ASN / ISP Change","tags":[],"interval":"1m","enabled":true,"revision":8,"description":"ITH – ASN / ISP Change","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-11m","rule_id":"c9ea6539-0408-4873-854b-9f73f802e5e0","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.scenario:\"asn_change\" OR event.action:\"asn_change\" OR raw.rule.name :\"ITH – ASN / ISP Change\"","filters":[],"actions":[{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","params":{"body":"{\r\n  \"rule_name\": \"{{rule.name}}\",\r\n  \"alert_id\": \"{{alert.id}}\",\r\n  \"severity\": \"{{context.rule.severity}}\",\r\n  \"risk_score\": \"{{context.rule.risk_score}}\",\r\n  \"timestamp\": \"{{date}}\"\r\n}"},"action_type_id":".webhook","uuid":"5a2db585-5300-48b3-9f9e-b58879b28cd0","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"53386dc7-882d-4be0-a6b4-1c7f20ff12d1","updated_at":"2025-10-17T13:34:35.763Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.745Z","created_by":"95289865","name":"ITH - Possible Brute-Force (source.ip + user.name)","tags":["ITH","Auth","NoConnector"],"interval":"1m","enabled":true,"revision":8,"description":"Counts failed authentications per source.ip and user.name over the interval in ITH indices.","risk_score":55,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"timestamp_override":"@timestamp","author":[],"false_positives":[],"from":"now-61m","rule_id":"ith-threshold-auth-bruteforce-nc-v5-1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name LIKE '%powershell%' OR name LIKE '%cmd.exe%' OR name LIKE '%curl%' OR name LIKE '%python%' OR name LIKE '%node%' OR name LIKE '%ssh%' OR name LIKE '%plink%' OR name LIKE '%pscp%' LIMIT 20;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"query":"SELECT p.name AS process_name, l.pid, l.address, l.port FROM listening_ports l JOIN processes p ON p.pid = l.pid WHERE l.port IN (22,80,135,139,389,443,445,636,3389) LIMIT 50;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"threshold","language":"kuery","index":["ith-events","ith-events-enriched","ith-events-enriched-demo","quantum-guardian"],"query":"event.category: \"authentication\" OR event.outcome: \"failure\" OR raw.rule.name: \"ITH*\"","filters":[],"threshold":{"field":[],"value":20,"cardinality":[]},"actions":[]}
{"id":"9013b3af-d440-4103-a43d-93a2d0a9ce57","updated_at":"2025-10-17T13:43:08.757Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.852Z","created_by":"95289865","name":"ITH – Rare Country Login","tags":[],"interval":"1m","enabled":true,"revision":8,"description":"ITH – Rare Country Login","risk_score":81,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-11m","rule_id":"4cdbd88d-91ef-428f-a1d8-6a2dc4980169","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.scenario:\"rare_country\" OR event.action:\"rare_country_login\" OR raw.rule.name :\"ITH – Rare Country Login\"","filters":[],"actions":[{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","params":{"body":"{\r\n  \"rule_name\": \"{{rule.name}}\",\r\n  \"alert_id\": \"{{alert.id}}\",\r\n  \"severity\": \"{{context.rule.severity}}\",\r\n  \"risk_score\": \"{{context.rule.risk_score}}\",\r\n  \"timestamp\": \"{{date}}\"\r\n}"},"action_type_id":".webhook","uuid":"21e29865-d115-4677-8067-b96f211bcfa4","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"57ef367d-b87c-46e5-a70e-541cb99be182","updated_at":"2025-10-17T14:11:10.069Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.854Z","created_by":"95289865","name":"ITH – Credential Stuffing","tags":[],"interval":"1m","enabled":true,"revision":7,"description":"ITH – Credential Stuffing","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-11m","rule_id":"4b023489-a281-449c-bf86-18463f9aecbe","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name LIKE '%powershell%' OR name LIKE '%curl%' OR name LIKE '%python%' OR name LIKE '%node%' OR name LIKE '%chrome%' OR name LIKE '%msedge%' OR cmdline LIKE '%Invoke-WebRequest%' OR cmdline LIKE '%Invoke-RestMethod%' LIMIT 20;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"query":"SELECT p.name AS process_name, s.pid, s.remote_address, s.remote_port, s.state FROM process_open_sockets s JOIN processes p ON p.pid = s.pid WHERE p.name LIKE '%powershell%' OR p.name LIKE '%curl%' OR p.name LIKE '%python%' OR p.name LIKE '%node%' OR p.name LIKE '%chrome%' OR p.name LIKE '%msedge%' LIMIT 50;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.scenario:\"credential_stuffing\" OR event.action:\"credential_stuffing\"\n","filters":[],"actions":[{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","params":{"body":"{\r\n  \"rule_name\": \"{{rule.name}}\",\r\n  \"alert_id\": \"{{alert.id}}\",\r\n  \"severity\": \"{{context.rule.severity}}\",\r\n  \"risk_score\": \"{{context.rule.risk_score}}\",\r\n  \"timestamp\": \"{{date}}\"\r\n}"},"action_type_id":".webhook","uuid":"59ac18a2-3b17-4e76-877e-3816a0059e31","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"60514024-e1f0-43da-aad5-d726831721f3","updated_at":"2025-10-17T13:56:07.489Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.725Z","created_by":"95289865","name":"Quantum Guardian – High QES","tags":[],"interval":"1m","enabled":true,"revision":6,"description":"Quantum Guardian – High QES","risk_score":89,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"timestamp_override":"event.time","timestamp_override_fallback_disabled":false,"author":[],"false_positives":[],"from":"now-11m","rule_id":"817e7c17-1875-4c6e-b85e-fe1a1238bc57","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["quantum-guardian"],"query":"qes.score >= 80\n","filters":[],"actions":[]}
{"id":"d60bb8aa-cd90-479e-b2bb-bd914f00cc14","updated_at":"2025-10-17T13:16:27.735Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.710Z","created_by":"95289865","name":"ITH High Risk Score (>= 90)","tags":["ith","risk"],"interval":"1m","enabled":true,"revision":6,"description":"Any event with risk.score >= 90.","risk_score":90,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"author":["ITH"],"false_positives":[],"from":"now-1h","rule_id":"ith-high-risk-score-90","max_signals":1000,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"risk.score >= 90","filters":[],"actions":[]}
{"id":"926d271f-5a66-4829-9c55-2a91a7818e53","updated_at":"2025-10-17T05:24:32.375Z","updated_by":"95289865","created_at":"2025-10-17T04:58:51.679Z","created_by":"95289865","name":"ITH Impossible Travel","tags":[],"interval":"1m","enabled":true,"revision":3,"description":"ITH Impossible Travel","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-11m","rule_id":"94bc76f4-5fde-457d-8c05-07473fb46f5e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"queries":[{"id":"ith_proc_sweep","query":"SELECT username, name AS process_name, path, cmdline\r\nFROM processes\r\nWHERE name LIKE '%vpn%' OR name LIKE '%remote%' OR name LIKE '%rdp%';\r\n","ecs_mapping":{}}]},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":"ITH AI score > 90 – automatic containment"},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.scenario:\"impossible_travel\" OR event.action:\"impossible_travel\"  OR raw.rule.name:\"ITH - Impossible Travel\"","filters":[],"actions":[{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","params":{"body":"{\r\n  \"rule_name\": \"{{rule.name}}\",\r\n  \"alert_id\": \"{{alert.id}}\",\r\n  \"severity\": \"{{context.rule.severity}}\",\r\n  \"risk_score\": \"{{context.rule.risk_score}}\",\r\n  \"timestamp\": \"{{date}}\"\r\n}"},"action_type_id":".webhook","uuid":"85101b35-7e64-4519-8f1b-0865a58b704d","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"90e0e947-7e22-4949-966a-c60f37e2833c","updated_at":"2025-10-17T14:58:15.697Z","updated_by":"95289865","created_at":"2025-10-17T14:58:15.697Z","created_by":"95289865","name":"ITH – Smoke Test (mfa_bypass)","tags":[],"interval":"1m","enabled":true,"revision":0,"description":"ITH – Smoke Test (mfa_bypass)","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"65d98877-4e28-467a-a4fe-20276bc971b6","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time,\r\n       name AS process_name, pid, path, cmdline\r\nFROM processes\r\nWHERE name != ''\r\nLIMIT 10;\r\n","timeout":60,"ecs_mapping":{}},"action_type_id":".osquery"}],"setup":"","type":"query","language":"kuery","index":["ith-events"],"query":"event.action:\"mfa_bypass\" AND agent.id:\"d80bac85-33db-4d24-ac09-b707d3b4ea05\"\n","filters":[],"actions":[]}
{"id":"846ca867-494b-4485-a89d-537559363fa5","updated_at":"2025-10-17T13:50:04.500Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.739Z","created_by":"95289865","name":"ITH Suspicious Test IP Ranges (Demo)","tags":["ith","demo"],"interval":"1m","enabled":true,"revision":7,"description":"Matches RFC5737 example IPs used in demo honey events.","risk_score":70,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"author":["ITH"],"false_positives":[],"from":"now-1h","rule_id":"ith-suspicious-test-ips","max_signals":1000,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"source.ip: \"203.0.113.*\" OR source.ip: \"198.51.100.*\"","filters":[],"actions":[]}
{"id":"a011cbb7-b2d9-4731-b195-cb210168ded4","updated_at":"2025-10-17T13:44:13.258Z","updated_by":"95289865","created_at":"2025-10-16T04:22:27.858Z","created_by":"95289865","name":"ITH – Quantum Adaptive Response","tags":[],"interval":"1m","enabled":true,"revision":9,"description":"Triggers adaptive live OSquery investigation when a high-risk identity event is detected.","risk_score":90,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"8247d6dc-9e2b-43e7-8a0a-9f22c287c7e9","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"command":"isolate","comment":"Reason: ITH AI score > 90 – automatic containment"},"action_type_id":".endpoint"},{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.scenario:\"impossible_travel\" \nOR event.action:\"impossible_travel\"  \nOR raw.rule.name:\"ITH - Impossible Travel\" \nOR risk.score >= 80\n","filters":[],"actions":[]}
{"id":"7a89a24f-6375-4c7f-bac8-43f43bfb0163","updated_at":"2025-10-17T14:10:08.845Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.731Z","created_by":"95289865","name":"ITH Canary Username Touched","tags":["ith","honey","canary"],"interval":"1m","enabled":true,"revision":7,"description":"Any event involving a canary user (user.name starts with canary-).","risk_score":95,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"author":["ITH"],"false_positives":[],"from":"now-1h","rule_id":"ith-canary-username","max_signals":1000,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"user.name: canary* OR user.id: canary* or raw.rule.name: \"ITH Canary Username Touched\"","filters":[],"actions":[]}
{"id":"d028d55f-70a0-4157-8899-797072006bf1","updated_at":"2025-10-17T13:58:36.351Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.857Z","created_by":"95289865","name":"ITH – Brute Force Then Success","tags":[],"interval":"1m","enabled":true,"revision":8,"description":"ITH – Brute Force Then Success","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-11m","rule_id":"d21593a4-dfb3-4c98-8b47-906f8b6d60cf","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name LIKE '%powershell%' OR name LIKE '%cmd.exe%' OR name LIKE '%curl%' OR name LIKE '%python%' OR name LIKE '%node%' OR name LIKE '%ssh%' OR name LIKE '%plink%' OR name LIKE '%pscp%' LIMIT 20;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"query":"SELECT p.name AS process_name, l.pid, l.address, l.port FROM listening_ports l JOIN processes p ON p.pid = l.pid WHERE l.port IN (22,80,135,139,389,443,445,636,3389) LIMIT 50;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.scenario:\"brute_force_then_success\" OR event.action:\"brute_force_then_success\" or raw.rule.name: \"ITH*\"\n","filters":[],"actions":[{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","params":{"body":"{\r\n  \"rule_name\": \"{{rule.name}}\",\r\n  \"alert_id\": \"{{alert.id}}\",\r\n  \"severity\": \"{{context.rule.severity}}\",\r\n  \"risk_score\": \"{{context.rule.risk_score}}\",\r\n  \"timestamp\": \"{{date}}\"\r\n}"},"action_type_id":".webhook","uuid":"d17843fe-4fbe-44e6-837a-038afa888250","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"2d7a74fc-bb28-4bb6-b19d-98ccd122542b","updated_at":"2025-10-17T14:08:13.442Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.843Z","created_by":"95289865","name":"ITH – Privilege Escalation","tags":[],"interval":"1m","enabled":true,"revision":8,"description":"ITH – Privilege Escalation","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"author":[],"false_positives":[],"from":"now-11m","rule_id":"1e1cc53d-7e02-4597-9ee6-2d89158a19c1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"raw.scenario:\"privilege_escalation\" OR event.action:\"privilege_escalation\"\n","filters":[],"actions":[{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","params":{"body":"{\r\n  \"rule_name\": \"{{rule.name}}\",\r\n  \"alert_id\": \"{{alert.id}}\",\r\n  \"severity\": \"{{context.rule.severity}}\",\r\n  \"risk_score\": \"{{context.rule.risk_score}}\",\r\n  \"timestamp\": \"{{date}}\"\r\n}"},"action_type_id":".webhook","uuid":"a9c8e390-a54c-4d6b-b918-893cc013c584","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"e2b37b52-51ad-4aee-82ca-bf1d4c9fc331","updated_at":"2025-10-17T14:00:09.808Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.727Z","created_by":"95289865","name":"ITH Honey Token Used","tags":["ith","honey","canary"],"interval":"1m","enabled":true,"revision":7,"description":"Detects canary token usage events.","risk_score":98,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"author":["ITH"],"false_positives":[],"from":"now-1h","rule_id":"ith-canary-token-used","max_signals":1000,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"event.action: \"canary_token_used\" OR raw.rule.name: \"ITH*\"","filters":[],"actions":[]}
{"id":"9eca0e9b-263f-401e-b4d0-09b63d9febc4","updated_at":"2025-10-17T13:43:40.181Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.704Z","created_by":"95289865","name":"ITH Honey-Identity Trap Detection","tags":["ith","honey","canary"],"interval":"1m","enabled":true,"revision":6,"description":"Detects honeypot/canary events from Identity Threat Hunter.","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"author":["ITH"],"false_positives":[],"from":"now-1h","rule_id":"ith-honey-identity-detection","max_signals":1000,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"event.category: \"honeypot\" OR event.action: (canary_user_login OR canary_token_used) OR tags: \"canary\"","filters":[],"actions":[]}
{"id":"483e2cbe-4f9e-4921-a362-4e63785c6e11","updated_at":"2025-10-17T15:59:31.058Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.846Z","created_by":"95289865","name":"ITH – MFA Bypass","tags":[],"interval":"1m","enabled":true,"revision":11,"description":"ITH – MFA Bypass","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"https://4e09aacaaf5546ea985fe43d16a0a09d.us-central1.gcp.cloud.es.io/app/security"},"timestamp_override":"@timestamp","author":[],"false_positives":[],"from":"now-11m","rule_id":"65147a06-b6d7-41cf-b96b-6821769457e3","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT name, path, pid, state FROM processes LIMIT 5;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"query":"SELECT p.name AS process_name, s.pid, s.remote_address, s.remote_port, s.state FROM process_open_sockets s JOIN processes p ON p.pid = s.pid WHERE p.name LIKE '%powershell%' OR p.name LIKE '%wscript%' OR p.name LIKE '%cscript%' OR p.name LIKE '%chrome%' OR p.name LIKE '%msedge%' OR p.name LIKE '%curl%' LIMIT 50;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"event.action:\"mfa_bypass\"\n","filters":[],"actions":[{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","params":{"body":"{\r\n  \"rule_name\": \"{{rule.name}}\",\r\n  \"alert_id\": \"{{alert.id}}\",\r\n  \"severity\": \"{{context.rule.severity}}\",\r\n  \"risk_score\": \"{{context.rule.risk_score}}\",\r\n  \"timestamp\": \"{{date}}\"\r\n}"},"action_type_id":".webhook","uuid":"d756e51e-25fc-4f8e-b732-819f205fb333","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"16906656-a667-4c85-aae0-885d51f1f87e","updated_at":"2025-10-17T13:44:50.402Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.723Z","created_by":"95289865","name":"ITH - First Seen Admin Tool on Host","tags":["ITH","Discovery/Lateral","NoConnector"],"interval":"1m","enabled":true,"revision":10,"description":"Flags the first observed execution of selected admin tools per host in ITH indices.","risk_score":50,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"timestamp_override":"@timestamp","author":[],"false_positives":[],"from":"now-61m","rule_id":"ith-newterms-admin-tool-nc-v5-1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[{"package":"osquery_manager","version":"^1.18.0"}],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"new_terms","query":"raw.rule.name: \"ITH*\"","new_terms_fields":["device.fingerprint","user.name"],"history_window_start":"now-7d","index":["ith-events","ith-events-enriched"],"filters":[],"language":"kuery","actions":[]}
{"id":"00d17c3b-34d9-4380-a27f-b01344583db4","updated_at":"2025-10-17T13:57:17.133Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.741Z","created_by":"95289865","name":"ITH - VSS Deleted via vssadmin","tags":["ITH","Ransomware-Precursors","NoConnector"],"interval":"1m","enabled":true,"revision":8,"description":"Detects deletion of Volume Shadow Copies via vssadmin delete shadows in ITH indices.","risk_score":85,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"timestamp_override":"@timestamp","author":[],"false_positives":[],"from":"now-61m","rule_id":"ith-vssadmin-delete-shadows-nc-v5","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE (name LIKE '%vssadmin%' AND cmdline LIKE '%delete%')    OR (name LIKE '%wmic%' AND cmdline LIKE '%shadowcopy%delete%')    OR (name LIKE '%powershell%' AND cmdline LIKE '%Delete%Shadow%Copy%') LIMIT 20;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"query":"SELECT name AS process_name, pid, path, cmdline FROM processes WHERE name LIKE '%wbadmin%' OR (name LIKE '%diskshadow%' AND cmdline NOT LIKE '%/s%') LIMIT 20;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events","ith-events-enriched"],"query":"raw.rule.name: \"ITH*\"","filters":[],"actions":[]}
{"id":"f5ca87e1-0fc7-4801-a434-23ff3c9bac5f","updated_at":"2025-10-17T13:56:38.713Z","updated_by":"95289865","created_at":"2025-10-09T12:36:44.712Z","created_by":"95289865","name":"ITH Canary User Login Attempt (Failure)","tags":["ith","honey","canary"],"interval":"1m","enabled":true,"revision":8,"description":"Detects canary user login attempts that failed.","risk_score":97,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":""},"author":["ITH"],"false_positives":[],"from":"now-1h","rule_id":"ith-canary-user-login-failure","max_signals":1000,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"response_actions":[{"params":{"query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;\r\n","timeout":60},"action_type_id":".osquery"},{"params":{"command":"isolate","comment":""},"action_type_id":".endpoint"}],"setup":"","type":"query","language":"kuery","index":["ith-events*"],"query":"event.action: \"canary_user_login\" AND event.outcome: \"failure\" OR raw.rule.name: \"ITH*\"","filters":[],"actions":[]}
{"id":"78b10d6f-3dd0-4146-91fd-313a4f96b71e","updated_at":"2025-10-17T06:23:35.190Z","updated_by":"95289865","created_at":"2025-10-17T05:36:54.884Z","created_by":"95289865","name":"Endpoint Security (Elastic Defend)","tags":["Data Source: Elastic Defend","Resources: Investigation Guide"],"interval":"1m","enabled":false,"revision":3,"description":"Generates a detection alert each time an Elastic Defend alert is received. Enabling this rule allows you to immediately begin investigating your Endpoint alerts.","risk_score":47,"severity":"medium","note":"## Triage and analysis\n\n> **Disclaimer**:\n> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.\n\n### Investigating Endpoint Security (Elastic Defend)\n\nElastic Defend is a robust endpoint security solution that monitors and protects systems by analyzing events and generating alerts for suspicious activities. Adversaries may exploit endpoints by executing unauthorized code or manipulating system processes. The detection rule leverages event data to identify alerts from Elastic Defend, focusing on potential threats while excluding non-relevant modules, thus enabling timely investigation of endpoint anomalies.\n\n### Possible investigation steps\n\n- Review the alert details to understand the specific event.kind:alert and event.module: endpoint that triggered the alert, ensuring it is not related to the excluded endgame module.\n- Examine the timeline of events leading up to the alert to identify any unusual or unauthorized activities, such as unexpected process executions or system changes.\n- Correlate the alert with other security events or logs from the same endpoint to gather additional context and determine if there is a pattern of suspicious behavior.\n- Investigate the source and destination of any network connections associated with the alert to identify potential command and control activity or data exfiltration attempts.\n- Check for any recent changes or updates to the endpoint's software or configuration that could explain the alert, ensuring they are legitimate and authorized.\n- Assess the risk score and severity of the alert in conjunction with other alerts from the same endpoint to prioritize the investigation and response efforts.\n\n### False positive analysis\n\n- Alerts triggered by routine software updates can be false positives. Users can create exceptions for known update processes to prevent unnecessary alerts.\n- System maintenance activities, such as scheduled scans or backups, may generate alerts. Exclude these activities by identifying their specific event signatures and adding them to the exception list.\n- Legitimate administrative actions, like remote desktop sessions or script executions by IT staff, might be flagged. Define exceptions for these actions by correlating them with authorized user accounts or IP addresses.\n- Frequent alerts from non-malicious applications that interact with system processes can be excluded by whitelisting these applications based on their hash or path.\n- Network monitoring tools that simulate attack patterns for testing purposes may trigger alerts. Exclude these tools by specifying their known behaviors and IP ranges in the exception settings.\n\n### Response and remediation\n\n- Isolate the affected endpoint immediately to prevent further unauthorized access or lateral movement within the network.\n- Analyze the alert details to identify the specific unauthorized code or process manipulation involved, and terminate any malicious processes identified.\n- Remove any unauthorized code or files from the affected endpoint, ensuring that all traces of the threat are eradicated.\n- Conduct a thorough review of system logs and event data to identify any additional indicators of compromise or related suspicious activities.\n- Update endpoint security configurations and signatures to prevent similar threats from exploiting the same vulnerabilities in the future.\n- Restore the affected endpoint from a known good backup if necessary, ensuring that the system is free from any residual threats.\n- Escalate the incident to the security operations center (SOC) or relevant team for further analysis and to determine if additional systems may be affected.","license":"Elastic License v2","output_index":"","rule_name_override":"message","timestamp_override":"event.ingested","author":["Elastic"],"false_positives":[],"from":"now-2m","rule_id":"9a1a2dae-0b5f-4c3d-8305-a268d404c306","max_signals":1000,"risk_score_mapping":[{"field":"event.risk_score","operator":"equals","value":""}],"severity_mapping":[{"field":"event.severity","operator":"equals","severity":"low","value":"21"},{"field":"event.severity","operator":"equals","severity":"medium","value":"47"},{"field":"event.severity","operator":"equals","severity":"high","value":"73"},{"field":"event.severity","operator":"equals","severity":"critical","value":"99"}],"threat":[],"to":"now","references":[],"version":108,"exceptions_list":[{"id":"endpoint_list","list_id":"endpoint_list","type":"endpoint","namespace_type":"agnostic"}],"immutable":true,"rule_source":{"type":"external","is_customized":false},"related_integrations":[{"package":"endpoint","version":"^9.0.0"}],"required_fields":[{"name":"event.kind","type":"keyword","ecs":true},{"name":"event.module","type":"keyword","ecs":true}],"response_actions":[{"params":{"queries":[{"id":"ith_primary","query":"SELECT strftime('%Y-%m-%d %H:%M:%S','now') AS collected_time, name AS process_name, pid, path, cmdline FROM processes WHERE name != '' LIMIT 15;","ecs_mapping":{}}]},"action_type_id":".osquery"}],"setup":"## Setup\n\n### Elastic Defend Alerts\nIf this rule is disabled, you will not receive alerts for Elastic Defend alerts. This rule is designed to capture all alerts generated by Elastic Defend. For more granular alerting, consider using additional prebuilt-rules that capture specific Elastic Defend alerts.\n\nIf this rule is enabled, along with the related rules listed below, you will receive duplicate alerts for the same events. To avoid this, it is recommended to disable this generic rule and enable the more specific rules that capture these alerts separately.\n\nRelated rules:\n- Behavior - Detected - Elastic Defend (UUID: 0f615fe4-eaa2-11ee-ae33-f661ea17fbce)\n- Behavior - Prevented - Elastic Defend (UUID: eb804972-ea34-11ee-a417-f661ea17fbce)\n- Malicious File - Detected - Elastic Defend (UUID: f2c3caa6-ea34-11ee-a417-f661ea17fbce)\n- Malicious File - Prevented - Elastic Defend (UUID: f87e6122-ea34-11ee-a417-f661ea17fbce)\n- Memory Threat - Detected - Elastic Defend (UUID: 017de1e4-ea35-11ee-a417-f661ea17fbce)\n- Memory Threat - Prevented - Elastic Defend (UUID: 06f3a26c-ea35-11ee-a417-f661ea17fbce)\n- Ransomware - Detected - Elastic Defend (UUID: 0c74cd7e-ea35-11ee-a417-f661ea17fbce)\n- Ransomware - Prevented - Elastic Defend (UUID: 10f3d520-ea35-11ee-a417-f661ea17fbce)\n\n### Additional notes\n\nFor information on troubleshooting the maximum alerts warning please refer to this [guide](https://www.elastic.co/guide/en/security/current/alerts-ui-monitor.html#troubleshoot-max-alerts).\n","type":"query","language":"kuery","index":["logs-endpoint.alerts-*"],"query":"event.kind:alert and event.module:(endpoint and not endgame)\n","actions":[]}
{"id":"471d4fc2-8139-4f4f-849c-f3142b8629ae","type":"action","updated_at":"2025-10-17T06:23:16.199Z","created_at":"2025-10-17T06:23:16.199Z","created_by":"u_95289865_cloud","updated_by":"u_95289865_cloud","version":"WzUzNjk2MiwxXQ==","attributes":{"actionTypeId":".webhook","name":"ITH Alert Webhook","isMissingSecrets":false,"config":{"method":"post","url":"https://ith-alert-wcax3xalza-uc.a.run.app/alert","hasAuth":false,"authType":null,"headers":null},"secrets":{}},"references":[],"managed":false,"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.1.0"}
{"exported_count":24,"exported_rules_count":23,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
